#include "Window.h"

// -----------------------------------------------------------------------------
/// コンストラクタ
/// サイズとタイトルを設定しウインドウを生成
/// ※引数に何も入れない場合はGlobal.hで設定した値がデフォルトで入ります
///
/// [in] width ウィンドウの幅
/// [in] height ウィンドウの高さ
/// [in]　title ウィンドウのタイトル
// -----------------------------------------------------------------------------
Window::Window(int width, int height, const	char *title)
{
	// ウィンドウサイズ固定
	glfwWindowHint(GLFW_RESIZABLE,GL_FALSE);

	// ウィンドウの生成
	window = glfwCreateWindow(width, height, title,	NULL, NULL);
	
	// ウィンドウ生成失敗
	if(window == NULL)
	{
		std::cerr	<<	"Can't create window."	<<	std::endl;
		exit(EXIT_FAILURE);
	}

	// ウィンドウを処理対象にする
	glfwMakeContextCurrent(window);

	// バッファの入れ替えタイミングの設定
	glfwSwapInterval(1);
}

// ----------------------------------------------------------------------------
/// デストラクタ
/// ウィンドウを破棄します
// ----------------------------------------------------------------------------
Window::~Window()
{
	glfwDestroyWindow(window);
}


// --------------------------------------------------
/// 初期化
/// ゲームの初期化処理を行います
// --------------------------------------------------
void Window::Init(){
}


// ---------------------------------------------------
/// 更新
/// ゲームの更新を行います
// ---------------------------------------------------
void Window::Update(){
}


// ---------------------------------------------------
/// 描画
/// 描画処理を行います
// ---------------------------------------------------
void Window::Draw(){
}


// ---------------------------------------------------
/// ダブルバッファの切り替えとイベント取得
// ---------------------------------------------------
void Window::swapBuffers(){
	// バッファの切り替え
	glfwSwapBuffers(window);
	// イベントの取得
	glfwPollEvents();
}
